Page({
  data:{
    tagArray:[
      {title:"文学",tags:["小说","外国文学","文学","随笔","经典","散文","诗歌","童话","杂文","名著","诗词"]},
      {title:"流行",tags:["漫画","绘本","推理","青春"," 言情","科幻","悬疑"," 武侠","网络小说","推理小说","穿越","轻小说","青春文学"," 科幻小说"]},
      {title:"历史文化",tags:["历史","心理学","哲学","传记","文化","社会学","艺术","社会","建筑","宗教","政治学","国学","戏剧","绘画","近代史","二战","考古"]},
      {title:"生活",tags:["爱情","旅行","生活","成长","励志","心理","摄影","女性","职场","美食","教育","健康","情感","手工","养生","人际关系","家居"]}
      ]
  },
  onLoad:function(options){
    // 页面初始化 options为页面跳转所带来的参数
  },

  goList(event) {
      const tag = event.target.dataset.tag
      wx.navigateTo({
          url:'../list/index?tag='+tag
      })
  }
})
